#+TODO: TODO | DONE FAIL N/A
* Tasks                                                             :DERIBIT:
  :PROPERTIES:
  :CATEGORY: deribit
  :CREATED:  20200309
  :ID:       fb1da497-7d80-44f5-a28c-911b125e3219
  :END:
** DONE Initial deribit gem release
   CLOSED: [2019-01-04 Fri] SCHEDULED: <2019-01-04 Fri>
** DONE public HTTP API
   CLOSED: [2019-02-27 Wed] SCHEDULED: <2019-02-27 Wed>
** DONE private HTTP API
   CLOSED: [2019-03-05 Tue] SCHEDULED: <2019-03-04 Mon>
** FIX API
** DONE use minitest
   CLOSED: [2019-02-26 Tue] SCHEDULED: <2019-02-26 Tue>
** DONE extract HTTP client
   CLOSED: [2019-04-23 Tue 15:24]
   :LOGBOOK:
   CLOCK: [2019-04-23 Tue 14:31]--[2019-04-23 Tue 15:18] =>  0:47
   :END:
** DONE public Websocket API
   CLOSED: [2019-04-02 Tue 13:12] SCHEDULED: <2019-03-29 Fri>
   :LOGBOOK:
   CLOCK: [2019-04-02 Tue 10:10]--[2019-04-02 Tue 13:12] =>  3:02
   :END:
** DONE private Websocket API
   CLOSED: [2019-04-17 Wed 18:26] SCHEDULED: <2019-04-16 Tue>
   :LOGBOOK:
   CLOCK: [2019-04-17 Wed 17:55]--[2019-04-17 Wed 18:26] =>  0:31
   CLOCK: [2019-04-16 Tue 12:23]--[2019-04-16 Tue 18:16] =>  5:53
   :END:
** N/A response middleware
** check key/secret present for private endpoints
** DONE fix trade history
   CLOSED: [2019-04-23 Tue 15:17]
** DONE research async websocket implementation
** cleanup 'params' for both http and websocket
** DONE update buy/sell endpoints with new params
** DONE initial 2.0 API implementaion
** DONE refactor Naming module
** deribit-api-ruby maintenance
   :PROPERTIES:
   :LAST_REPEAT: [2021-12-11 Sat 08:41]
   :ID:       512776a1-df85-4587-b414-6a2830aaae57
   :END:
   - State "DONE"       from "TODO"       [2021-12-11 Sat 08:41]
   - State "DONE"       from "TODO"       [2021-06-09 Wed 08:31]
   - State "DONE"       from "TODO"       [2020-12-14 Mon 09:05]
   - State "DONE"       from "TODO"       [2020-06-10 Wed 07:36]
   - State "DONE"       from "TODO"       [2020-05-13 Wed 14:14]
   - State "DONE"       from "TODO"       [2020-04-23 Thu 13:25]
   - State "DONE"       from "TODO"       [2020-01-09 Thu 18:00]
   - State "DONE"       from "TODO"       [2019-10-21 Mon 14:43]
   - State "DONE"       from "TODO"       [2019-07-02 Tue 13:01]
   - State "DONE"       from "TODO"       [2019-04-23 Tue 15:24]
   - State "DONE"       from "TODO"       [2019-04-17 Wed 18:26]
   - State "DONE"       from "TODO"       [2019-04-02 Tue 13:02]
